TheMalkavien/RP2040_WIFI_BLE_OTA/src/ble/ble_upload.cpp
#include "ble_upload.h"
#include "config.h"
#include "rp2040_flasher.h"
#include "main.h"
#include "ota_from_spiffs.h"

extern Uploader* uploader;

static BleUpload* gBle = nullptr;

static QueueHandle_t s_bleRxQ = nullptr;
static TaskHandle_t  s_writerTask = nullptr;


// ===== Callbacks compatibles NimBLE-Arduino =====
class ServerCallbacks : public NimBLEServerCallbacks {
  void onConnect(NimBLEServer* s) override {
    if (gBle) gBle->notifyClients("log:Client BLE connecté.");

    // handle=0 : unique connexion
    s->updateConnParams(0, 6, 9, 0, 400);
  }
  void onDisconnect(NimBLEServer* s) override {
    if (gBle) gBle->notifyClients("error:Client BLE déconnecté.");
    s->getAdvertising()->start();
  }
};

class CtrlCallbacks : public NimBLECharacteristicCallbacks {
  void onWrite(NimBLECharacteristic* c) override {
    if (!gBle) return;
    std::string v = c->getValue();
    gBle->handleCtrlCommand(v);
  }
};

class DataCallbacks : public NimBLECharacteristicCallbacks {
  void onWrite(NimBLECharacteristic* c) override {
    if (!gBle) return;
    std::string v = c->getValue();
    if (!v.empty()) {
      gBle->onDataChunk(reinterpret_cast<const uint8_t*>(v.data()), v.size());
    }
  }
};

BleUpload::BleUpload() { gBle = this; }

void BleUpload::Setup() {
  NimBLEDevice::init(MY_BLE_NAME);

  NimBLEDevice::setPower(ESP_PWR_LVL_P21);

  NimBLEDevice::setMTU(517);

  server = NimBLEDevice::createServer();
  auto *cbs = new ServerCallbacks();
  server->setCallbacks(cbs);

  service = server->createService(FW_SERVICE_UUID);

  ctrlChar = service->createCharacteristic(
      CTRL_CHAR_UUID,
      NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR
  );
  ctrlChar->setCallbacks(new CtrlCallbacks());

  dataChar = service->createCharacteristic(
      DATA_CHAR_UUID,
      NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR
  );
  dataChar->setCallbacks(new DataCallbacks());

  notifChar = service->createCharacteristic(
      NOTIF_CHAR_UUID,
      NIMBLE_PROPERTY::NOTIFY
  );

  service->start();
  adv = NimBLEDevice::getAdvertising();
  adv->addServiceUUID(FW_SERVICE_UUID);
  adv->setScanResponse(true);
  adv->setMinInterval(800);                  // 0.5s attention l'unité est 0.625ms
  adv->setMaxInterval(1600);                  //1s
  adv->start();
  advRunning = true;

  notifyClients("log:BLE prêt. Publicité en cours.");
}


void BleUpload::notifyClients(const String &message) {
  if (!notifChar) return;
  notifChar->setValue((uint8_t*)message.c_str(), message.length());
  notifChar->notify();
}

void BleUpload::loop() {
  // Rien à faire ici
}

void BleUpload::beginUpload(size_t total) {
  resetInactivityTimer();
  if (binFile) binFile.close();
  expectedSize = total;
  received = 0;
  lastProgressPct = -1;
  binFile = LittleFS.open("/firmware.bin", "w");
  if (!binFile) { notifyClients("error:Impossible d'ouvrir /firmware.bin"); return; }

  if (!s_bleRxQ) s_bleRxQ = xQueueCreate(64, sizeof(BleChunk));  // 64 x 256 = 16 KiB buffer
  if (!s_writerTask) {
    xTaskCreatePinnedToCore([](void* arg){
      BleUpload* self = static_cast<BleUpload*>(arg);
      BleChunk c;
      for(;;){
        if (xQueueReceive(s_bleRxQ, &c, portMAX_DELAY) == pdTRUE) {
          if (self->binFile) self->binFile.write(c.data, c.len);
          self->received += c.len;
          if (self->expectedSize > 0) {
            int p = (int)((self->received * 100ull) / self->expectedSize);
            // throttle 250 ms mini
            static uint32_t lastMs=0; static int lastPct=-1;
            uint32_t now=millis();
            if ((p != lastPct) && (p - lastPct >= 1 || now - lastMs >= 250)) {
              self->notifyClients(String("log:Téléversement en cours: ") + p + "%");
              lastPct = p; lastMs = now;
            }
            if (self->received >= self->expectedSize) self->endUpload();
          }
        }
      }
    }, "ble_fs_writer", 4096, this, 2, &s_writerTask, 1);
  }
}

void BleUpload::endUpload() {
  resetInactivityTimer();
  if (binFile) {
    binFile.close();
    lastProgressPct = -1;
    notifyClients("EVENT:UPLOAD_COMPLETE");
    notifyClients("log:Fichier reçu (BLE). Prêt à préparer le flash.");
  }
}

void BleUpload::onDataChunk(const uint8_t* data, size_t len) {
  if (!binFile || !s_bleRxQ) { notifyClients("error:Upload non initialisé."); return; }
  while (len > 0) {
    BleChunk c;
    size_t n = len > sizeof(c.data) ? sizeof(c.data) : len;
    memcpy(c.data, data, n);
    c.len = (uint16_t)n;
    if (xQueueSend(s_bleRxQ, &c, 0) != pdTRUE) {
      // file pleine: on attend un peu pour ne pas drop
      vTaskDelay(1);
      continue;
    }
    data += n; len -= n;
  }
}


void BleUpload::handleCtrlCommand(const std::string& s) {
  resetInactivityTimer();
  if (s == "CMD:REBOOT_RP2040") {
    notifyClients("log:Reboot RP2040 (BLE)...");
    digitalWrite(RESETRP2040_PIN, LOW);
    delay(100);
    digitalWrite(RESETRP2040_PIN, HIGH);
    delay(100);
    notifyClients("success:RP2040 redémarré.");
    return;
  }
  if (s == "CMD:REBOOT_ESP32") {
    notifyClients("log:Reboot ESP32 (BLE)...");
    delay(50);
    ESP.restart();
    return;
  }
  if (s.rfind("START_UPLOAD:", 0) == 0) {
    size_t total = strtoul(s.c_str() + strlen("START_UPLOAD:"), nullptr, 10);
    beginUpload(total);
    return;
  }
  if (s == "END_UPLOAD") {
    endUpload();
    return;
  }
  if (s == "CMD:PREPARE_FLASH") {
    uploader->notifyClients("log:Commande reçue (BLE). Préparation bootloader RP2040...");
    digitalWrite(BOOTLOADER_PIN, LOW);
    delay(100);
    digitalWrite(RESETRP2040_PIN, LOW);
    delay(100);
    digitalWrite(RESETRP2040_PIN, HIGH);
    delay(100);
    uploader->notifyClients("log:En attente de la réponse du RP2040...");
    startFlashProcess();
    uploader->notifyClients("EVENT:RP2040_BOOTLOADER_MODE");
    return;
  }
  if (s == "CMD:START_FLASH") {
    if (rp2040BootloaderActive) {
      digitalWrite(BOOTLOADER_PIN, HIGH);
      uploader->notifyClients("log:Démarrage du flash (BLE)...");
      startFlashProcess(SEND_INFO_COMMAND);
    } else {
      uploader->notifyClients("error:Le RP2040 n'est pas en mode bootloader.");
    }
    return;
  }
  if (s == "CMD:APPLY_OTA") {
    auto cb = [this](int pct, const char* msg){
      if (msg && *msg) this->notifyClients(String("log:") + msg);
      else             this->notifyClients(String("log:OTA en cours: ") + pct + "%");
    };

    BaseType_t ok = ota_start_task(
        "/firmware.bin",
        cb,                         // ← virgule ici
        false,
        "ble_ota_task",
        8192,
        1,
        1
    );
    if (ok != pdPASS) notifyClients("error:Impossible de lancer la tâche OTA (BLE).");
    else              notifyClients("log:Lancement OTA (BLE) en tâche dédiée.");
    return;
  }
  uploader->notifyClients(String("error:Commande BLE inconnue: ") + s.c_str());
}
